#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.trend-getter-key: Refreshing state... [id=a47ca5ce69932d82542644f179386827027c4e11]
data.aws_subnet.public_3: Reading...
aws_key_pair.trend-getter-ec2-key: Refreshing state... [id=c18-trend-getter-kp]
data.aws_iam_policy_document.lambda_permissions_notif: Reading...
aws_ecr_repository.c18-trend-getter-dashboard-ecr: Refreshing state... [id=c18-trend-getter-dashboard-ecr]
data.aws_subnet.public_2: Reading...
data.aws_iam_policy_document.lambda_role: Reading...
aws_iam_role.eventbridge_invoke_stepfunction_role: Refreshing state... [id=c18-tg-event-sm-role]
data.aws_iam_policy_document.lambda_role_notif: Reading...
data.aws_iam_policy_document.lambda_permissions_notif: Read complete after 0s [id=2637988731]
aws_ecr_repository.trend-getter-lambda-ecr: Refreshing state... [id=trend-getter-lambda-ecr]
data.aws_iam_policy_document.lambda_role_notif: Read complete after 0s [id=2690255455]
data.aws_iam_policy_document.lambda_role: Read complete after 0s [id=3917546067]
aws_iam_role.step_function_role: Refreshing state... [id=step-function-execution-role]
aws_ecr_repository.trend-getter-extract-and-load-ecr: Refreshing state... [id=trend-getter-extract-and-load-ecr]
data.aws_iam_policy_document.lambda_permissions: Reading...
aws_ecr_repository.c18-trend-getter-notifications-ecr: Refreshing state... [id=c18-trend-getter-notifications-ecr]
data.aws_iam_policy_document.lambda_permissions: Read complete after 0s [id=1274356838]
aws_s3_bucket.c18-trend-getter-s3: Refreshing state... [id=c18-trend-getter-s3]
data.aws_vpc.main: Reading...
aws_iam_policy.step_function_policy: Refreshing state... [id=arn:aws:iam::129033205317:policy/step-function-lambda-invoke-policy]
data.aws_subnet.public_1: Reading...
aws_iam_role.lambda_role: Refreshing state... [id=c18-data-getter-lambda-role]
data.aws_subnet.public_3: Read complete after 1s [id=subnet-0aed07ac008a10da9]
aws_iam_role.lambda_role_notif: Refreshing state... [id=c18-data-getter-notif-lambda-role]
aws_iam_policy.lambda_s3_policy: Refreshing state... [id=arn:aws:iam::129033205317:policy/c18-data-getter-lambda-s3-policy]
aws_iam_role_policy_attachment.step_function_attach_policy: Refreshing state... [id=step-function-execution-role/arn:aws:iam::129033205317:policy/step-function-lambda-invoke-policy]
data.aws_subnet.public_2: Read complete after 1s [id=subnet-0f10662561eade8c3]
data.aws_subnet.public_1: Read complete after 0s [id=subnet-0679d4b1f9e7839ef]
aws_db_subnet_group.rds_subnet_group: Refreshing state... [id=c18-trend-getter-rds-subnet-group]
aws_lambda_function.lambda_function_notif: Refreshing state... [id=c18-trend-getter-notifications-function]
aws_iam_role_policy_attachment.lambda_s3_attach: Refreshing state... [id=c18-data-getter-lambda-role/arn:aws:iam::129033205317:policy/c18-data-getter-lambda-s3-policy]
aws_lambda_function.lambda_function: Refreshing state... [id=c18-trend-getter-lambda-function]
data.aws_vpc.main: Read complete after 1s [id=vpc-0adcb6a62ca552c01]
aws_security_group.rds_sg: Refreshing state... [id=sg-0699c97d0de8afddc]
aws_security_group.trend-getter-ec2-sg: Refreshing state... [id=sg-0ec95d6742c91e9bb]
aws_instance.ec2: Refreshing state... [id=i-034fe5b94adc3d579]
aws_db_instance.postgresql: Refreshing state... [id=db-UU2R632XBCS7PYO2UOF2LKE3AE]
aws_lambda_permission.allow_lambda: Refreshing state... [id=AllowExecutionFromETLLambda]
aws_sfn_state_machine.etl_sm: Refreshing state... [id=arn:aws:states:eu-west-2:129033205317:stateMachine:c18-trendgetter-etl-notif-sm]
aws_s3_bucket_notification.s3_eventbridge: Refreshing state... [id=c18-trend-getter-s3]
aws_lambda_permission.allow_s3: Refreshing state... [id=AllowExecutionFromS3]
aws_s3_bucket_notification.s3_trigger: Refreshing state... [id=c18-trend-getter-s3]
aws_iam_policy.eventbridge_invoke_stepfunction_policy: Refreshing state... [id=arn:aws:iam::129033205317:policy/c18-tg-event-policy]
aws_iam_role_policy_attachment.attach_eventbridge_invoke_stepfunction: Refreshing state... [id=c18-tg-event-sm-role/arn:aws:iam::129033205317:policy/c18-tg-event-policy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_event_rule.s3_put_event will be created
  + resource "aws_cloudwatch_event_rule" "s3_put_event" {
      + arn            = (known after apply)
      + description    = "Triggers step function on S3 object creation"
      + event_bus_name = "default"
      + event_pattern  = jsonencode(
            {
              + detail      = {
                  + bucket = {
                      + name = [
                          + "my-trigger-bucket-name",
                        ]
                    }
                }
              + detail-type = [
                  + "Object Created",
                ]
              + source      = [
                  + "aws.s3",
                ]
            }
        )
      + force_destroy  = false
      + id             = (known after apply)
      + name           = "trigger-stepfunction-on-upload"
      + name_prefix    = (known after apply)
      + region         = "eu-west-2"
      + tags_all       = (known after apply)
    }

  # aws_cloudwatch_event_target.trigger_stepfunction will be created
  + resource "aws_cloudwatch_event_target" "trigger_stepfunction" {
      + arn            = "arn:aws:states:eu-west-2:129033205317:stateMachine:c18-trendgetter-etl-notif-sm"
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + region         = "eu-west-2"
      + role_arn       = "arn:aws:iam::129033205317:role/c18-tg-event-sm-role"
      + rule           = "trigger-stepfunction-on-upload"
      + target_id      = (known after apply)
    }

  # aws_ecr_repository.c18-trend-getter-bsky-bot-ecr will be created
  + resource "aws_ecr_repository" "c18-trend-getter-bsky-bot-ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "c18-trend-getter-bsky-bot-ecr"
      + region               = "eu-west-2"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)
    }

  # aws_s3_bucket.trigger_bucket will be created
  + resource "aws_s3_bucket" "trigger_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "my-trigger-bucket-name"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "eu-west-2"
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_notification.s3_trigger will be updated in-place
  ~ resource "aws_s3_bucket_notification" "s3_trigger" {
      ~ eventbridge = true -> false
        id          = "c18-trend-getter-s3"
        # (2 unchanged attributes hidden)

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + lambda_function_arn = "arn:aws:lambda:eu-west-2:129033205317:function:c18-trend-getter-lambda-function"
        }
    }

Plan: 4 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @jacoblewis046, Action: `pull_request`*